In [1]:
import numpy as np
import matplotlib.pyplot as plt

In [2]:
from pandas import Series, DataFrame

In [3]:
import pandas as pd

In [4]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [5]:
df

      data1     data2 key1 key2
0  0.450107  0.201244    a  one
1 -2.008960  0.254500    a  two
2 -0.236972  0.575449    b  one
3 -0.141701 -1.758704    b  two
4 -0.671625  0.087478    a  one

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a   -0.743493
b   -0.189336
Name: data1, dtype: float64

In [12]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [13]:
means

key1  key2
a     one    -0.110759
      two    -2.008960
b     one    -0.236972
      two    -0.141701
Name: data1, dtype: float64

In [14]:
cities = np.array(['Seoul', 'Busan', 'Busan', 'Seoul', 'Seoul'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([cities, years]).mean()

Busan  2005   -2.008960
       2006   -0.236972
Seoul  2005    0.154203
       2006   -0.671625
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.743493  0.181074
b    -0.189336 -0.591628

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.110759  0.144361
     two  -2.008960  0.254500
b    one  -0.236972  0.575449
     two  -0.141701 -1.758704

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [18]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.450107  0.201244    a  one
1 -2.008960  0.254500    a  two
4 -0.671625  0.087478    a  one
b
      data1     data2 key1 key2
2 -0.236972  0.575449    b  one
3 -0.141701 -1.758704    b  two

In [19]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0  0.450107  0.201244    a  one
4 -0.671625  0.087478    a  one
('a', 'two')
     data1   data2 key1 key2
1 -2.00896  0.2545    a  two
('b', 'one')
      data1     data2 key1 key2
2 -0.236972  0.575449    b  one
('b', 'two')
      data1     data2 key1 key2
3 -0.141701 -1.758704    b  two

In [21]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':       data1     data2 key1 key2
 0  0.450107  0.201244    a  one
 1 -2.008960  0.254500    a  two
 4 -0.671625  0.087478    a  one, 'b':       data1     data2 key1 key2
 2 -0.236972  0.575449    b  one
 3 -0.141701 -1.758704    b  two}

In [22]:
pieces['b']

      data1     data2 key1 key2
2 -0.236972  0.575449    b  one
3 -0.141701 -1.758704    b  two

In [23]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [24]:
grouped = df.groupby(df.dtypes, axis=1)

In [25]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  0.450107  0.201244
 1 -2.008960  0.254500
 2 -0.236972  0.575449
 3 -0.141701 -1.758704
 4 -0.671625  0.087478, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

# Selecting a column or subset of columns

In [26]:
df.groupby(['key1', 'key2'])[['data2']].mean()   #double [] are used to enter more than one column.

              data2
key1 key2
a    one   0.144361
     two   0.254500
b    one   0.575449
     two  -1.758704

In [27]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [28]:
s_grouped.mean()

key1  key2
a     one     0.144361
      two     0.254500
b     one     0.575449
      two    -1.758704
Name: data2, dtype: float64

# Group with dic and series

In [29]:
people = DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [30]:
people.ix[2:3, ['b', 'c']] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe     1.222158 -1.135099 -0.060325 -0.360578 -0.243154
Steve  -0.197384  0.909437 -1.051071 -1.613078 -0.290837
Wes     0.309529       NaN       NaN -1.220080 -0.960568
Jim    -0.566678 -1.267379  0.916525 -1.583808 -0.213613
Travis  1.859400 -0.132643 -0.761338 -1.257432  0.051620

In [31]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [32]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe    -0.420903 -0.156095
Steve  -2.664149  0.421217
Wes    -1.220080 -0.651040
Jim    -0.667283 -2.047670
Travis -2.018770  1.778377

In [33]:
map_series = Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [36]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

# Grouping with function

In [37]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.965009 -2.402478  0.856200 -3.164466 -1.417335
5 -0.197384  0.909437 -1.051071 -1.613078 -0.290837
6  1.859400 -0.132643 -0.761338 -1.257432  0.051620

In [38]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.309529 -1.135099 -0.060325 -1.220080 -0.960568
  two -0.566678 -1.267379  0.916525 -1.583808 -0.213613
5 one -0.197384  0.909437 -1.051071 -1.613078 -0.290837
6 two  1.859400 -0.132643 -0.761338 -1.257432  0.051620

# Grouping by index level

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
[1, 3, 5, 1, 3]], names=['cty', 'tenor'])
hier_df = DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.302859  0.021120  0.403015  0.215736 -0.438588
1      0.356428 -1.276775 -0.105326 -0.918631  2.055926
2      1.400237  0.256102 -0.881380 -1.176180  0.748946
3      1.069641  1.076769  0.679137  0.482006  0.435939

In [40]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [41]:
hier_df.groupby(level='tenor', axis=1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

# Data Argegation

In [42]:
df

      data1     data2 key1 key2
0  0.450107  0.201244    a  one
1 -2.008960  0.254500    a  two
2 -0.236972  0.575449    b  one
3 -0.141701 -1.758704    b  two
4 -0.671625  0.087478    a  one

In [43]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.225761
b   -0.151228
Name: data1, dtype: float64

In [46]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.459068  0.167023
b     0.095271  2.334153

In [47]:
grouped.describe()

               data1     data2
key1
a    count  3.000000  3.000000
     mean  -0.743493  0.181074
     std    1.231108  0.085319
     min   -2.008960  0.087478
     25%   -1.340293  0.144361
     50%   -0.671625  0.201244
     75%   -0.110759  0.227872
     max    0.450107  0.254500
b    count  2.000000  2.000000
     mean  -0.189336 -0.591628
     std    0.067367  1.650496
     min   -0.236972 -1.758704
     25%   -0.213154 -1.175166
     50%   -0.189336 -0.591628
     75%   -0.165518 -0.008089
     max   -0.141701  0.575449